app/controllers/pages_controller.rb

  def create
    user = User.find_by(email: params[:emails])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "id"], ["LIMIT", 1]]